Revit 2027 API
SunAndShadowSettings.Longitude Property
 Identifies the current longitude used by the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
public:
property double Longitude {
	double get ();
}
member Longitude : float with get
Property Value
Double
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace